app/Controllers/Attendance.php

    public function attendance_list(){
        $this->data['page_title']="Attendances";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->att_model->countAllResults();
        $this->data['attendances'] = $this->att_model
                                    ->select("`attendance`.*, `employees`.code, CONCAT(`employees`.last_name, ', ', `employees`.first_name, COALESCE(CONCAT(' ', `employees`.middle_name), '')) as `name`")
                                    ->join('employees','`attendance.employee_id = employees.id`','inner')
                                    ->paginate($this->data['perPage']);
---
SELECT COUNT(*) AS `numrows`
FROM `attendance`
INNER JOIN `employees` ON `attendance`.`employee_id` = `employees`.`id`
SELECT `attendance`.*, `employees`.`code`, CONCAT(`employees`.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', `employees`.middle_name), '')) as `name`
FROM `attendance`
INNER JOIN `employees` ON `attendance`.`employee_id` = `employees`.`id`
 LIMIT 10